---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.VelocityPressure
source: html/95df69a8-1347-e254-fc16-6a64f427b816.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem.VelocityPressure Property

The velocity pressure, for converting between coefficient and pressure drop on this flow path. Units: (kg/(ft·s²)).

## Syntax (C#)
```csharp
public double VelocityPressure { get; }
```